import { Text } from 'react-font';
import Step from './Step';

const StepProgressBar = () => {

  return (
    <div className="step-progress-bar">
      <div className='step-title'>
        <Text family='Unbounded' weight={700}>ЧАСОВІ РАМКИ</Text>
      </div>
      <Step className='round' isLast={false} date={'Липень'} step={'1 Етап:'} title={'Збір заявок'} desc={'Команди втілюють ідеї в проєктні заявки, відвідують тренінги та зустрічі в рамках програми “Амбасадори Дрогобича”'}/>
      <Step className='round' isLast={false} date={'Серпень'} step={'2 Етап:'} title={'Оцінювання проєктів'} desc={'Амбасадори Дрогобича у закритому чаті голосують за незалежне журі. П’ять представників журі оцінює заявки. Кандидатури незалежного журі, за які голосують Амбасадори, формуються з: 50% з громадських активістів, представників бізнесу Дрогобича, а також 50% запрошених громадських активістів, бізнесів з інших міст України, які є експертами у своїх сферах. Завдяки цьому ми маємо кваліфіковану, багатогранну та незалежну оцінку поданих проєктів'}/>
      <Step className='round' isLast={false} date={'Вересень - Жовтень'} step={'3 Етап:'} title={'Реалізація проєктів'} desc={'Після оголошення результатів команди-переможці отримують кошти для реалізації власних проєктів. Усі події в межах ініціатив, а також їхні результати висвітлюються в соціальних мережах ґрантової програми “Амбасадори Дрогобича”.'}/>
      <Step className='round' isLast={true} date={'Листопад'} step={'4 Етап:'} title={'Фіналізація сезону'}/>
    </div>
  )
}

export default StepProgressBar;
